/*
  CHANGE ONLY THIS FILE TO PERSONALIZE THE WEBSITE.

  1. Put photos in assets/photos/
  2. Name them photo1.jpg, photo2.jpg, etc.
  3. Put your song in assets/music/song.mp3
  4. Set the birthday date if you want the countdown.
*/

const SITE_CONFIG = {
  herName: "Malak",
  yourName: "Karim",

  birthday: {
    // Format: YYYY-MM-DDTHH:MM:SS
    // Set null to hide the countdown.
    date:"2026-10-29T00:00:00"
    // Example:
    // date: "2026-10-15T00:00:00"
  },

  intro: {
    title: "♥️كل سنه وانتي طيبه ي ملاكي",
    text: "كنت عايز اعملك حاجه بنفسي وتفضل معاكي،ف قلت اعملك مكان صغير نعيش فيه جزء من حكايتنا،حاجه استثنائيه زيك❤️"
  },

  story: [
    {
      date: "Your eyes",
      title: "في عينيكِ شئٌ من السحر كلما أطلت النظر ازداد عشقي ،و في كلامهما لحنٌ من الليل كلما أصغيتُ إليه راقَ لي السهر",
      text: ""
    },
    {
      date: "Your eyes again👀",
      title: "هل خُلِقَ الجمالُ لِتخْتصِرهُ عيْنيْكِ؟ أم عيْناكِ خُلِقَتْ لتقنعني أنّ لا جَمالَ خُلِقَ بعدُها؟",
      text: ""
    },
    {
      date: "and Your eyes again",
      title: "تِلكَ العُيون التي إجتمع فيها سِحرُ البحر،و هدوءَ السّماء، كيف لنظرةٍ واحدةٍ منها أن تجعل القلم ينسي صمته،والحروفَ تَركضُ نحو إسمك دون إذن؟، فَكلّ قصيدة بعدَكِ ناقصةٌ، و كل غزلٍ لم يمرّ من عينيكِ لا يستحق أن يكونَ غزلًا",
      text: ""
    }
  ],

  photos: [
    { src: "assets/photos/photo1.jpg", caption: "اهو سيد دا بقا زميلك و صاحبك و حبيبك و رفيق مشوارك و توأم روحك...انا لما رديت عليكي وقلتلك كدا كنت عارف ان كل دا هييجي وعارف اننا هنبقي قريبين اوي من بعض كدا ولسه كمان ،الرد اللي رديتهولك دا موصلش للمرحله اللي انا كنت حاططها ف دماغي ساعتها بس هنوصل ان شاء الله وهفكرك بردو بالذكري دي زي ما بفكرك بيها دلوقتي." },
    { src: "assets/photos/photo2.jpg", caption: "دي بقا توثيق لاول مره نكون مع بعض ف المكان اللي انتي كنتي بتحبي تهربيله واللي كنتي بتحبي تقعدي فيه لوحدك، اليوم دا ليه شعور خاص لانك كنتي واحشاني لدرجه تجنن انا حرفيا ف الفتره دي كان نفسي اعمل اي حاجه لمجرد بس اني اشوفك حتي لو هيطلبوا نص عمري، انا الفتره دي كنت متدايق لاني كان نفسي اساعدك ف الفتره اللي انتي كنتي فيها دي بس انتي مكنتيش عاطياني فرصه،عيني اول ما شافتك ساعتها مكانتش مصدقه انها اخيرا لقت اللي كانت بتدور عليه،لقت بيتها اخيرا وملجأها والمكان اللي بتهربله من بشاعه الدنيا وصعوبه ومراره الايام، اول ما سرحت ف عينك يومها سرحت كتير اوي و غوصت في عالم عيونك العالم اللي بحبه جدا ودايما بحب اتوه فيه واتوه بين جماله ،اليوم دا انا م هنسي فيه فرحتك اللي متوقعتهاش الحقيقه علي الهديه البسيطه اوي اوي اللي عطتهالك يومها، كنت بقول في دماغي انك يعيني عليكي متعرفيش ان انا نفسي اجيبلك الدنيا تحت رجلك ونفسي اي حاجه حرفيا تقع عليها عينك اجيبهالك دا كفايه ان عينك شافتها بس، رغم اني اتدايقت ان السوم خلص بسرعه بس اليوم دا بالنسبه لي كان هدوء واستقرار للروح اخيرا بعد توهان وضياع كبير اوي ليها ف الفتره اللي قبلها" },
    { src: "assets/photos/photo3.jpg", caption: "اول مره لبستي فيها الجاكيت، الجاكيت اللي كنت ببقي دايما حريص انه يكون معايا كل يوم واول حاجه كنت بعملها لما اصحي الصبح ونازل الكليه اني احط الجاكيت معايا ،عمرك ما هتصدقي انا كنت مستني اللحظه دي قد اي ولا حتي هتصدقي انا كنت بفكر فيها من وقت قد اي انا حرفيا كنت بفكر فيها من قبل حتي ما الشتا ييجي ،مش هنسي شكلك التحفه ساعتها وانتي لابساه ولما فعدنا ف المتحف يومها ولا هنسي شعورك بالاحتواء والدفا و الامان اللي كنتي حساهم مشاعرك دي كانت باينه اوي ساعتها" },
    { src: "assets/photos/photo4.jpg", caption: "نا مش عارف ابدا اتكلم عن اي اليوم دا بالذات، عن اللي حصل فيه ولا عن مشاعري ساعتها من الصبح ولا عن ازاي اليوم دا خلص،لو قعدت اكتب حرفيا مش هقدر اني اجكي كل تفاصيل اليوم دا بالذات نانا من اول لحظه شفتك فيها اليوم دا وانا كان باين عليا وكان عيني باين عليها انها قد اي كانت مسحوره بيكي و كان باين عليها انها ساعتها شافت اجمل حاجه شافتها ف حياتها و ان النهارده اليوم الموعود و ان دا اليوم الفارق واللي هيقلب علاقتنا 180 درجه، لما شفتك الصبح خالص مكنتش عارف ولا قادر اتكلم لاني عارف اليوم دا انا هعمل فيه اي بالليل بعد ما تخلصي الالماني ،روحنا بعد ما خلصنا المستشفي ومفيش اي حاجه ف دماغي غير اني مش عارف اذا كنت هقدر اعملها ولا لا ، انا مكنتش عارف اطلع الكلمه دي خالص لما كنت بحاول اتدرب عشان اقولها من اول مره، وعلي قد منا عايز لوقت يجري واوصل للحظه اللي انا مستنيها بقالي فتره كبيره اوي اوي ،، الحظه اللي انا مبعرفش انام الليل بسببها، علي قد منا مكنتش عايز الوقت ييجي لاني مكنتش واثق اني هعرف اقولها،كان عندي كميه مشاعر متضاربه وعكس بعض وحرفيا انا مش فاكر اليوم دا انا حسيت بالشبع او بالجوع او بالعطش او بالتعب طول اليوم كله، كانت حاجات ملهاش لازمه خالص اليوم دا بالنسبه لي ،جهزت نفسي رغم اني مكنتش جاهز وجهزت حاجتي وجهزت الكمنجه ،الكمنجه اللي عزفت ف اهم يوم ف حياتي و ف حياتك والكمنجه اللي شهدت علي حبنا عشان كدا انا عايز ارجعلها وعشان كدا انا مش عايز ارميها لانها معزفتش ل اي حد دي عزفت لأجمل و احلي بنت ف الدنيا كلها ،بعد ما جهزت حاجتي وجهزت الهديه ف الشنطه نزلت ،نزلت وانا متوتر وقلقان ومش عارف هعمل اي، رحت حضرت كورس الكمنجه اللي مش فاكر اصلا الحقيقه اخدت في ايخ لاني مكنتش مركز اصلا وكنت سرحان كتير و المايسترو لاحظ كدا ،بعد ما خلصت قلت لنفسي يا اما هتقولها دلوقتي يا مش هتقولها باقي عمرك كله، ضحكت علي نفسي بالكلمتين دول وصدقت نفسي وكل حاجه عملتها كنت عشان صدقت اللي قلته دا ،رحت اكمل في فكرتي اللي كنت محضرها ليكي من فتره كبيره وهي اني اجمعلك كل حاجه انتي بتحبيها في يوم عيد ميلادك وحطيت نفسي من ضمن الحاجات دي ف الاخر ،قعدت اجمع معلومات كتير اوي عنك واحنا بنتكلم عشان اليوم دا ، انك بتحبي الشاورما جدا ، وانك بتحبي الايس لاتيه من حسن اللي ف فرع الشاطبي تحديدا ، و انك حبيتي اني بتعلم عزف ع الكمنجه، خلصت كورس الموسيقي وقعدت امشي،امشيييي، لغايه ما وصلت لمطعم ابن الباشا في محطه الرمل عشان اجبلك منه الشاورما اللي بتحبيها ، و بعدها رحت وجبتلك ايس لاتيه من حسن ،وجتلك الكليه بعد ما خلصتي كورس الالماني ،ملامح وشي كانت متغيره اوي ساعتها وانتي لاحظتي دا ، وانا حسيت انك عرفتي اني هعترفلك النهارده،عينك اليوم دا من ساعه ما شفتك بعد الالماني مش هقدر انساها،كانت بترد عليا قبل ما اعترف اصلا وبتقولي انا كمان بحبك بس انت قولها بس، عطيتك الايس كوفي واللي عجبك جدا ساعتها واتمشينا المشيه اللي الطريق حفظنا بيها خلاص من كتر ما مشيناها مع بعض لغايه ما وصلنا للمكان الاحب الي قلبنا والمكان اللي شهد علي اجمل واحلي و ارق اعتراف وقصه حب انا شفتها ف حياتي ،حاولت اخد نفسي بعد تعب ومشي مسافات انا محستش بيها وانا ماشيها من كتر مشاعري وتركيزي اللي رايحين وباصين علي حاجه واحده بس،رجلي ساعتها كانت كانها بتولع من كتر المشي اللي مشيته يومها بس محستش بيه غير في اخر اليوم خالص و اخيرا وبعد هينتات مني كتيره جدا كل حاجه كانت غامضه بالنسبه لك بانت ،وابتديت معاكي فقره فقره لغايه الفقره الاخيره اللي كنت انا وانتي مستنيينها ، بحبك،كلمه من اربع حروف وسهله اوي ف كتابتها ونطقها، بس صعبه اوي اوي اوي انها تتقال اول مره بجد، صعبه اوي اوي اوي ف معناها و انك تقولها لحد ،عرفتي تهزمي عقلي وعرفتي تتخطي كل الحدود اللي كنت حاططها علي قلبي خوفا منه انه يتاذي  بس انتي بنظره من عيونك اللي هزمتني بمجرد نظره واحده بس عرفتي تهزميني ودي بالنسبه لي اعظم هزيمه واجمل هزيمه اتهزمها ف حياتي كلها ، و قلتها!!! عرفت اتغلب علي كل مخاوفي و قلقي وافكاري السودويه عن الحب وعن الناس ،و عرفت اتغلب علي توتري اللي باين عليا من اول اليوم ، ومن بعدها وانا حياتي بقت اجمل حياه اعيشها في حياتي ، وبقا و لاول مره يبقي عندي ذكريات وعندي ماضي حلو ، انتي الماضي والحاضر والمستقبل الحلو بتاعي وهتفضلي كدا للأبد...    بحبك    هقولهاك كل سنه وكل شهر وكل اسبوع وكل يوم و كل ساعه وكل ثانيه... بحبك وهقولهالك كل سنه بطريقه مختلفه غير اللي قبلها وهعيشك اجمل لحظه في حياتك كل مره بطريقه احلي من اللي قبلها علي قد ما اقدر ، هبدا كلامي ب بحبك وهنهي كلامك ب بحبك و في ما بين البدايه والنهايه هقولك بحبك ، كل خليه ف جسمي بتقولك بحبك وكل نفس بتنفسه بيقولك بحبك وكل نظره ليكي بتقولك بحبك وكل حرف بكتبهولك بيقولك بحبك، بحبك وهفضل اقولهالك طول العمر يا عمري اللي بدأ معاكي وهينتهي معاكي بحببببببببببــــكـــــكككككككككــك 🥺♥️" },
    { src: "assets/photos/photo5.jpg", caption: "انا يوم الرحله دي مكنتش مصدق نفسي،ولا كنت مصدق ولا فاهم اصرارك ساعتها انك تيجي الرحله دي اوي كدا ،ولا حتي كنت مصدق اني هقضي معاكي حرفيا يوم كامل من اوله ل اخره واني هشوفك كم الساعات دي كلها،كان حلم بالنسبه لي ،وبرغم اننا قعدنا بعيد عن بعض في الاتوبيس بس كان كفايه عليا اني اشوف طرحتك بس قدامي و اشوف هزات راسك ع الرسايل اللي كنت ببعتهالك علي الواتس، ولا كنت مصدق القعده الحلوه اللي قعدناها كلنا مع بعض ولا الضحك اللي ضحكناه ولا الناس اللي قابلناهم واتعرفنا عليهم ولعبنا معاهم ووقت اللعب كان اول مره نبص لبعض ونفهم لغه عيون بعض واننا فاهمين بعض اوي كدا والباقي م فاهم حاجه ،ولا اقدر انسي اول كوبايه شاي شربتها من ايدك،ولا اقدر انسي كم الامان اللي انتي كنتي حساه يوميها ولا كم الثقه انك تتصوري ع تليفوني ساعتها ولا عمري كنت اصدق ان انا اصورك بتليفوني و ب ايدي، اليوم دا انا طلعت بصور كتير اوي حلوه للبحر والرمله والشمس والصخور بس اجمل صوره طلعت بيها بجد هي صورك انتي وانا شايف ان دي اجمل صور انا صورتها ف حياتي كلها،ومقدرش انسي كم المشاعر اللي كنت حاسسها ناحيتك ساعتها ومخبيها ولا اقدر انسي نظراتي ليكي اللي كنت بحاول اخبيها ،كان يوم بالنسبه لي ولا ف الاحلام ولا كنت اصدق اني هكون معاكي ف رحله زي دي اصلا" },
    { src: "assets/photos/photo6.jpg", caption: "الرحله اللي بالنسبه لي مكانتش مجرد رحله بس دي كانت توثيق لاول مره ادوق فيها حاجه بايدك الحلوه اللي مبتعملش غير كل حاجه حلوه ،عمري ما هقدر اوصف حلاوه وجمال وطعامه الاكل ،الاكل نزل ف قلبي بجد ،الاكل كان ممزوج بطعم تحفه ومشاعر كتيره اوي اوي وعمري ما هنسي شعوري ساعتها اني باكل من ايد حبيبتي ونور عيني ،دا غير ملامح وشك القمر التحفه اللي كانت بتقدمليي الاكل بكل حب واللي مهتمه بتفاصيل التفاصيل لمجرد انك عرفتي اني بحب الحامي جبتيلي فلفل مخصوص عشااني والاكل كان حلو بجد بطريقه لا توصف، دا غير شكلك اللي انبهرت بيه اول ما شفتك واحنا رايحين هناك والالوان الخطيره اللي كنتي لابساها كان يوم تحفه بسببك وبسبب انك كنتي فيه" },
    { src: "assets/photos/photo7.jpg", caption: "👀اول مره اجيبلك فيها شكولاته" },
    { src: "assets/photos/photo8.jpg", caption: "المكان المفضل لينا والمكان اللي شهد ع قصه حبنا ومازال مكاننا المفضل وهيفضل مكاننا المفضل واللي هيشهد علي قصه خطوبتنا وقصه جوازنا كمان" },
    { src: "assets/photos/photo9.jpg", caption: "اول مره اجيبلك فيها الورد ومجبتش غيرها اصلا بس استني المفاجآت الجايه" },
    { src: "assets/photos/photo10.jpg", caption: "انا سايب الذكري دي فاضيه عشان هتتحط النهارده" }
],

  reasons: [
   "ابْتِسَامتكِ التِي جَعلتْنِي أقَع في غرامِ روحِك، وتفَاصِيلك التِي جَعَلَتنِي أرَي فيكِ شيئًا مُميزًا واسْتِثْنَائِيًا عَن الجَمِيع، فجَمَالِكِ الدَاخِلي أَسَرَنِي، وأضَافَ بُعدًا آخرًا للجَمَال، لمْ يصِل إليهِ أحَدًا سِوَاكِ",
    "وَجهَكِ ضوءٌ كأنّ الجمَال كلّه اجتمع فيكَ ليُصبح بكِ أجْمَل",
    "من ذا القمر الذي تجرّأ أن يتشبّهَ بكِ؟...دلّيني عليهِ لأجْعَلَ من نورِهِ قُرْبانًا لجمالكِ، كيف لحجرٍ يستَعِير ضوءَهُ أن يُقَارن بوجْهٍ إذا أشرقَ خَجَلَ مِنْهُ الضياءُ",
    "أُريدُكِ أنْ تَعرفِي أنكِ جميلة، فالجَمَالُ ليسَ شكْلًا فقط،فجمَالكِ ينْبعُ مِن داخِلك،وهذا يظْهرُ علي مِلامحك الهادِئة التي تُشْعرني براحةٍ لم أشعُرُ بها مِن قبل",
    "إن كَانَ في هَذا العالمِ أملٌ.....فهُو أنتِ، و إن كَانَ للغدِ سبَبٌ لإنتَظِرُه ... فهو إن تَكونِي فيه",
    "هل تكفيكِ كلّ كَلِمَاتِ الحُبّ لتعرفي ما في قلبي لكِ؟...لا أظُن...فثمانيةٌ وعشرونَ حرْفًا ولو امتدّتْ إلي آلافِ الصَفَحاتِ ستَبْقي عاجِزةً عن حمل حبٍّ لا تَسِعْهُ الكَلِمات",
    "إنْ كَانَ القَمَرَ يُؤنِسُ الليْل،فَعيْنَاكِ تُؤنِسَان الرُوح",
    "♥️يلِيقُ بكِ أنْ تكُونِي ضوْءا لا ينْطَفئ،أن تَكُوني وردًا لا يَمُوت و ماءًا لا يَجف،يَلِيقُ بكِ أن تَكُونِي كُ الأشياءِ البَعيدة التِي لا يَعْبرهَا الحُزن بومًا ما",
    "♥️كَيفَ أخْبِركِ بأنّكِ أجمل شئٍ حدث في عُمْري؟ و أجمل شئٍ بالُنيا أُحبه؟ و أن الإكْتِفاءَ بكِ أجمَل شعور حسّه قلبي؟...والحقيقة لم أجد يومًا يُضاهِي جمال اليَومِ الذي جَمَعنِي بكِ، عَسي أيامي كُلها حَولكِ و معكِ وبجانبك",
    "إذا كَانَ يُمكنَنِي إعطائِكِ شيئًا واحدًا في هذِه الحَياة كُنتُ سأمنحكِ القُدرة علي رُؤيةِ نَفْسكِ بعَيْنيّ،حِينهَا فقطْ ساُدرِكِ كم أنتِ شخْصٌ إستثْنائي بالنسْبَةِ إليّ"
  ],

  letters: [
    {
      title: "Open when you miss me",
      text:"ستبقين الحب الذي لم أندم عليهِ أبدًا...سأحبكِ وكأنني لم أجد أعظم من قلبك لأحتفظ به ،ستبقين ملاذي و حبي الأبدي وعلي عهد هذا الحب سأظل، فلا الغياب سَرقَ مَلامحكِ ،ولا الصمتُ أخمد نبرتكِ في أعْماقي ... يمرُّ الوقت ويبقي حبّك الثابت الوحيد مُتجذرًا في روح لا تطولها المسافات ولا تكسرها الظروف ... ستظلين العمر والوطن الذي لا أنتمي إلا إليه و إن عجزت يداي عن الوصول إليكِ وبخلت الأيام باللقاء ،فإن روحي ستبقي تحرسكِ بالدعاء وتُدفئكِ من بردِ الفراقِ...أكتفي بطيفكِ عن كل الحاضرين مستندًا علي أمل خفيّ بِأن القلوب الصادقة لا بد أن تلتقي ،و أنّ مَن مَلَكَ الروح ....لا يغيبُ"
    },
    {
      title: "Open when youwant to know How I'm lucky to have you.",
      text:"Out of all the people this world has created with all the roads I could have taken and all the lives I could have lived,Some impossible miracle of timing allowed my story to cross paths with yours,and if I spend the rest of my life searching for a word greater than lucky ,I still don't think it would be enough to explain what YOU are to me... مش عارف جت معايا انجليزي ،حُبّك خلاني اكتبلك بلغات مختلفه كمان😂😂"
    },
    {
      title: "Open when you need a smile",
      text: "يعني كل اللي انا عامله دا ومبتسمتيش🤨😂😂😂"
    },
    {
      title: "Open when you want to know how much I love you",
      text: "لو اجتمعت كل لغات الأرض لتكتب ما اشعر به نحوك،لعجزت عن وصف ذره مما يسكن قلبي ...فَأنتِ لست حبًا عابرًا،بل وطناحتمت به روحي،وقدرُُ جميلُُ اخشي ان تمسُّه الأيام، و حلمُُ أدعو الله كل ليله ألآ اصحو منه ،أُحبك بطريقةٍ لا تشبهُُ أحدًا،وكأنّ الله خلق قلبي ليعرف اسمك فقط،و خلق عينيَّ لتبحثا عنك بين وجوه العالم،ثُم تطمئنا حين تراك...وإن كان للعمر أمنية واحدة أخيرة، فهي ان أبقي الي جوارك ما بقي في صدري نفس ،لأن الحياة بدونك ليست حياة ،بل أيامُُ بلا روح"    }
  ],

  letter: {
    title: "في يومِ ميلادِك لا تكْفي الكَلِمَاتِ لوصْفِ فرْحتِي بوُجودك في حَياتِي،هذَا اليَوم ليْس مُجرّدِ تاريخٌ في التَقْويم بَل يَومٌ جَاءَ فِيهِ إلى الُدنْيا شخصٌ جَعَلَ أيامِي أجْمل و أهدأ و أدفأ...أتمني لكِ عامًا جدِيدًا ممتلِئ بالضَحكاتِ و الطَمأنِينَة و تَحقِيق كل ما تَتمنّيه... و أسأل الله أن يحفظ قلْبَكِ مِن كلّ حُزن و أن يَفتح لكِ أبواب الخيْرِ و السَعَادةِ في كلّ خطوه تَخْطِيهَا ...شُكرًا لأنّكَ كُنْتِ دائما سَبَبًا لإبتسَامَتِي و سَنَدِي في كُل أوقاتِي الصعبه و الُحلوة...وجودك هِديّة ثَمِينة و أتمني أن تَبقَي ايامِك القِادمه أجملَ مِن كُل مَا مَضَي.....كُلّ عامٍ و أنتِ بخيْر و كُل عامٍ وأنتِ أقرب النَاسِ إلي قَلبِي",
    paragraphs: [
      "Happy birthday, Malak. I hope you know how much you mean to me.",
      "I cannot put every feeling into one page, but I can tell you one thing. I am grateful for every conversation, every laugh, every memory, and every moment we chose to share.",
      "I hope this year gives you reasons to smile, goals to reach, and days you will want to remember.",
      "And I hope I get to be there for many of those days."
    ]
  },

  finalText:"كل عام وانتَ لحيَاتِي حَياة، و كُلّ عامٍ و انتِ أمان عُمرِي، لا اهنّئكِ اليَومَ بمِيلَادكِ فَحسب,بل اهنئ الدُنْيا لأنها شهدت يومَ ميلادِ قلْبٍ بصفاءِ قَلبِك...بَحِبّكككـ❤️ـكككك"
};
